/****************************************************************/
/*	action.h													*/
/****************************************************************/
/*	Author: Ranhao zhang
	Copyright 2023(c) Space Mechatronics Laboratory,
  	School of Astronautics NUAA									*/
/****************************************************************/
/*  Description:
  		This file is the header file of action.c
		 														*/
/****************************************************************/
/*  Revision History:
	7/18/2023(Ranhao): Created
																*/
/****************************************************************/

#ifndef __ACTION_H__
#define __ACTION_H__

/* ------------------------------------------------------------ */
/*				Include File Definitions						*/
/* ------------------------------------------------------------ */
#include "fsm.h"
#include <stdio.h>
#include "xil_printf.h"
/* ------------------------------------------------------------ */
/*				Miscellaneous Declarations						*/
/* ------------------------------------------------------------ */

/* ------------------------------------------------------------ */
/*				Global Variables Declaraitons  					*/
/* ------------------------------------------------------------ */

/* ------------------------------------------------------------ */
/*				Procedure Declarations							*/
/* ------------------------------------------------------------ */

enum
{
  IDLE,					//1280×720 60fps 彩色图像输出
  EDGE_SEGMENTATION, 	//边缘分割（四分频，左上角是预处理过后的灰度图，右上角是自适应阈值分割，左下角是八连通域查找图像，右下角是边缘分割最终结果）
  QUADS_RAW,			//四边形初步拟合
  EDGE_REFINEMENT,		//四边形边缘细化
  SAMPLES,				//对四边形周边目标点进行采样
  OUTPUT				//最终输出图像
};

ACTION_MAP_t *get_action_map(u8 *total);

#endif
